/*
 * ibus-viethoa - The Viethoa engine for IBus
 *
 * Copyright (c) 2020-2021 Duy Thai, ngocduy.thai@yahoo.com
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2, or (at your option)
 * any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301, USA.
 */
#include "VHZTelexTable.h"
#include "VHVNLetters.h"

struct _TELEX_VN_CLUTTER{
	// telex clutter
    gchar* telex_clutter;
	// vietnamese clutter
    gchar* vn_clutter;
};

struct _CORRECT_CLUTTER{
	// a telex clutter that need to be make correct
    gchar* clutter;
	// a telex that was made correct
    gchar* correct_clutter;
};

// A table used to convert a telex clutter into vietnamese characters

static struct _TELEX_VN_CLUTTER _clutters[] = {
	// a
    {"az", "á"},
   	{"af", "à"},
   	{"ar", "ả"},
   	{"ax", "ã"},
   	{"aj", "ạ"},
	//
    {"áf", "à"},
   	{"ár", "ả"}, 
	{"áx", "ã"}, 
	{"áj", "ạ"},
	//
    {"àz", "á"}, 
	{"àr", "ả"},
   	{"àx", "ã"}, 
	{"àj", "ạ"},
	//
    {"ảz", "á"}, 
	{"ảf", "à"}, 
	{"ảx", "ã"}, 
	{"ảj", "ạ"},
	//
    {"ãz", "á"}, 
	{"ãf", "à"}, 
	{"ãr", "ả"}, 
	{"ãj", "ạ"},
	//
    {"ạz", "á"}, 
	{"ạf", "à"}, 
	{"ạr", "ả"},
   	{"ạx", "ã"},
	
	// ai //////////////////////////////////////////////
    {"aiz", "ái"},
    {"aif", "ài"},
    {"air", "ải"},
    {"aix", "ãi"},
    {"aij", "ại"},
	//
    {"áif", "ài"},
   	{"áir", "ải"},
   	{"áix", "ãi"},
   	{"áij", "ại"},
	//
    {"àiz", "ái"},
   	{"àir", "ải"},
   	{"àix", "ãi"}, 
	{"àij", "ại"},
	//
    {"ảiz", "ái"}, 
	{"ảif", "ài"}, 
	{"ảix", "ãi"}, 
	{"ảij", "ại"},
	//
    {"ãiz", "ái"}, 
	{"ãif", "ài"}, 
	{"ãir", "ải"}, 
	{"ãij", "ại"},
	//
    {"ạiz", "ái"}, 
	{"ạif", "ài"}, 
	{"ạir", "ải"}, 
	{"ạix", "ãi"},
    
	// ao /////////////////////////////////////////////
    {"aoz", "áo"},
    {"aof", "ào"},
    {"aor", "ảo"},
    {"aox", "ão"},
    {"aoj", "ạo"},
	//
    {"áof", "ào"}, 
	{"áor", "ảo"}, 
	{"áox", "ão"}, 
	{"áoj", "ạo"},
	//
    {"àoz", "áo"}, 
	{"àor", "ảo"}, 
	{"àox", "ão"}, 
	{"àoj", "ạo"},
	//
    {"ảoz", "áo"}, 
	{"ảof", "ào"}, 
	{"ảox", "ão"}, 
	{"ảoj", "ạo"},
	//
    {"ãoz", "áo"}, 
	{"ãof", "ào"}, 
	{"ãor", "ảo"}, 
	{"ãoj", "ạo"},
	//
    {"ạoz", "áo"}, 
	{"ạof", "ào"}, 
	{"ạor", "ảo"}, 
	{"ạox", "ão"},
    
	// au ////////////////////////////////////////////
    {"auz", "áu"},
    {"auf", "àu"},
    {"aur", "ảu"},
    {"aux", "ãu"},
    {"auj", "ạu"},
	//
    {"áuf", "àu"}, 
	{"áur", "ảu"}, 
	{"áux", "ãu"}, 
	{"áuj", "ạu"},
	//
    {"àuz", "áu"}, 
	{"àur", "ảu"}, 
	{"àux", "ãu"}, 
	{"àuj", "ạu"},
	//
    {"ảuz", "áu"}, 
	{"ảuf", "àu"}, 
	{"ảux", "ãu"}, 
	{"ảuj", "ạu"},
	//
    {"ãuz", "áu"}, 
	{"ãuf", "àu"}, 
	{"ãur", "ảu"}, 
	{"ãuj", "ạu"},
	//
    {"ạuz", "áu"}, 
	{"ạuf", "àu"}, 
	{"ạur", "ảu"}, 
	{"ạux", "ãu"},
    
	// ay ////////////////////////////////////////////////
    {"ayz", "áy"},
    {"ayf", "ày"},
    {"ayr", "ảy"},
    {"ayx", "ãy"},
    {"ayj", "ạy"},
	//
    {"áyf", "ày"}, 
	{"áyr", "ảy"}, 
	{"áyx", "ãy"}, 
	{"áyj", "ạy"},
	//
    {"àyz", "áy"}, 
	{"àyr", "ảy"}, 
	{"àyx", "ãy"}, 
	{"àyj", "ạy"},
	//
    {"ảyz", "áy"}, 
	{"ảyf", "ày"}, 
	{"ảyx", "ãy"}, 
	{"ảyj", "ạy"},
	//
    {"ãyz", "áy"}, 
	{"ãyf", "ày"}, 
	{"ãyr", "ảy"}, 
	{"ãyj", "ạy"},
	//
    {"ạyz", "áy"}, 
	{"ạyf", "ày"}, 
	{"ạyr", "ảy"}, 
	{"ạyx", "ãy"},

	// ă //////////////////////////////////////////////
    {"aw", "ă"}, 
	//
	{"ăz", "ắ"}, 
	{"ăf", "ằ"}, 
	{"ăr", "ẳ"}, 
	{"ăx", "ẵ"}, 
	{"ăj", "ặ"},
	//
    {"ắf", "ằ"}, 
	{"ắr", "ẳ"}, 
	{"ắx", "ẵ"}, 
	{"ắj", "ặ"},
	//
    {"ằz", "ắ"}, 
	{"ằr", "ẳ"}, 
	{"ằx", "ẵ"}, 
	{"ằj", "ặ"},
	//
    {"ẳz", "ắ"}, 
	{"ẳf", "ằ"}, 
	{"ẳx", "ẵ"}, 
	{"ẳj", "ặ"},
	//
    {"ẵz", "ắ"}, 
	{"ẵf", "ằ"}, 
	{"ẵr", "ẳ"}, 
	{"ẵj", "ặ"},
	//
    {"ặz", "ắ"}, 
	{"ặf", "ằ"}, 
	{"ặr", "ẳ"}, 
	{"ặx", "ẵ"},

	// â ////////////////////////////////////////////////////// 	
    {"aa", "â"},
	//
    {"âz", "ấ"},
    {"âf", "ầ"},
    {"âr", "ẩ"},
    {"âx", "ẫ"},
    {"âj", "ậ"},
	//
    {"ấf", "ầ"}, 
	{"ấr", "ẩ"}, 
	{"ấx", "ẫ"}, 
	{"ấj", "ậ"},
	//
    {"ầz", "ấ"}, 
	{"ầr", "ẩ"}, 
	{"ầx", "ẫ"}, 
	{"ầj", "ậ"},
	//
    {"ẩz", "ấ"}, 
	{"ẩf", "ầ"}, 
	{"ẩx", "ẫ"}, 
	{"ẩj", "ậ"},
	//
    {"ẫz", "ấ"}, 
	{"ẫf", "ầ"}, 
	{"ẫr", "ẩ"}, 
	{"ẫj", "ậ"},
	//
    {"ậz", "ấ"}, 
	{"ậf", "ầ"}, 
	{"ậr", "ẩ"}, 
	{"ậx", "ẫ"},

    // âu ///////////////////////////////////////////////////
    {"âuz", "ấu"},
    {"âuf", "ầu"},
    {"âur", "ẩu"},
    {"âux", "ẫu"},
    {"âuj", "ậu"},
    //
    {"ấuf", "ầu"}, 
	{"ấur", "ẩu"}, 
	{"ấux", "ẫu"}, 
	{"ấuj", "ậu"},
	//
    {"ầuz", "ấu"}, 
	{"ầur", "ẩu"}, 
	{"ầux", "ẫu"}, 
	{"ầuj", "ậu"},
	//
    {"ẩuz", "ấu"}, 
	{"ẩuf", "ầu"}, 
	{"ẩux", "ẫu"}, 
	{"ẩuj", "ậu"},
	//
    {"ẫuz", "ấu"}, 
	{"ẫuf", "ầu"}, 
	{"ẫur", "ẩu"}, 
	{"ẫuj", "ậu"},
	//
    {"ậuz", "ấu"}, 
	{"ậuf", "ầu"}, 
	{"ậur", "ẩu"}, 
	{"ậux", "ẫu"},
    
	// ây ////////////////////////////////////////////////
    {"âyz", "ấy"},
    {"âyf", "ầy"},
    {"âyr", "ẩy"},
    {"âyx", "ẫy"},
    {"âyj", "ậy"},
    // 
    {"ấyf", "ầy"}, 
	{"ấyr", "ẩy"}, 
	{"ấyx", "ẫy"}, 
	{"ấyj", "ậy"},
	//
    {"ầyz", "ấy"}, 
	{"ầyr", "ẩy"}, 
	{"ầyx", "ẫy"}, 
	{"ầyj", "ậy"},
	//
    {"ẩyz", "ấy"}, 
	{"ẩyf", "ầy"}, 
	{"ẩyx", "ẫy"}, 
	{"ẩyj", "ậy"},
	//
    {"ẫyz", "ấy"}, 
	{"ẫyf", "ầy"}, 
	{"ẫyr", "ẩy"}, 
	{"ẫyj", "ậy"},
	//
    {"ậyz", "ấy"}, 
	{"ậyf", "ầy"}, 
	{"ậyr", "ẩy"}, 
	{"ậyx", "ẫy"},

	// đ ///////////////////////////////////////////////////
    {"dd", "đ"},

	// e //////////////////////////////////////////////////
    {"ez", "é"},
    {"ef", "è"},
    {"er", "ẻ"},
    {"ex", "ẽ"},
    {"ej", "ẹ"},
    // 
    {"éf", "è"}, 
	{"ér", "ẻ"}, 
	{"éx", "ẽ"}, 
	{"éj", "ẹ"},
	//
    {"èz", "é"}, 
	{"èr", "ẻ"}, 
	{"èx", "ẽ"}, 
	{"èj", "ẹ"},
	//
    {"ẻz", "é"}, 
	{"ẻf", "è"}, 
	{"ẻx", "ẽ"}, 
	{"ẻj", "ẹ"},
	//
    {"ẽz", "é"}, 
	{"ẽf", "è"}, 
	{"ẽr", "ẻ"}, 
	{"ẽj", "ẹ"},
	//
    {"ẹz", "é"}, 
	{"ẹf", "è"}, 
	{"ẹr", "ẻ"}, 
	{"ẹx", "ẽ"},

	// eo //////////////////////////////////////////////////
    {"eoz", "éo"},
    {"eof", "èo"},
    {"eor", "ẻo"},
    {"eox", "ẽo"},
    {"eoj", "ẹo"},
    //  
    {"éof", "èo"}, 
	{"éor", "ẻo"}, 
	{"éox", "ẽo"}, 
	{"éoj", "ẹo"},
	//
    {"èoz", "éo"}, 
	{"èor", "ẻo"}, 
	{"èox", "ẽo"}, 
	{"èoj", "ẹo"},
	//
    {"ẻoz", "éo"}, 
	{"ẻof", "èo"}, 
	{"ẻox", "ẽo"}, 
	{"ẻoj", "ẹo"},
	//
    {"ẽoz", "éo"}, 
	{"ẽof", "èo"}, 
	{"ẽor", "ẻo"}, 
	{"ẽoj", "ẹo"},
	//
    {"ẹoz", "éo"}, 
	{"ẹof", "èo"}, 
	{"ẹor", "ẻo"}, 
	{"ẹox", "ẽo"},
    
	// ê ////////////////////////////////////////////////////
	{"ee", "ê"},
	//
    {"êz", "ế"},
    {"êf", "ề"},
    {"êr", "ể"},
    {"êx", "ễ"},
    {"êj", "ệ"},
    // 
	{"ếf", "ề"}, 
	{"ếr", "ể"}, 
	{"ếx", "ễ"}, 
	{"ếj", "ệ"},
	//
    {"ềz", "ế"}, 
	{"ềr", "ể"}, 
	{"ềx", "ễ"}, 
	{"ềj", "ệ"},
	//
    {"ểz", "ế"}, 
	{"ểf", "ề"}, 
	{"ểx", "ễ"}, 
	{"ểj", "ệ"},
	//
    {"ễz", "ế"}, 
	{"ễf", "ề"}, 
	{"ễr", "ể"}, 
	{"ễj", "ệ"},
	//
    {"ệz", "ế"}, 
	{"ệf", "ề"}, 
	{"ệr", "ể"}, 
	{"ệx", "ễ"},
    
	// êu /////////////////////////////////////////////////////
    {"êuz", "ếu"},
    {"êuf", "ều"},
    {"êur", "ểu"},
    {"êux", "ễu"},
    {"êuj", "ệu"},
    //  
    {"ếuf", "ều"}, 
	{"ếur", "ểu"}, 
	{"ếux", "ễu"}, 
	{"ếuj", "ệu"},
	//
    {"ềuz", "ếu"}, 
	{"ềur", "ểu"}, 
	{"ềux", "ễu"}, 
	{"ềuj", "ệu"},
	//
    {"ểuz", "ếu"}, 
	{"ểuf", "ều"}, 
	{"ểux", "ễu"}, 
	{"ểuj", "ệu"},
	//
    {"ễuz", "ếu"}, 
	{"ễuf", "ều"}, 
	{"ễur", "ểu"}, 
	{"ễuj", "ệu"},
	//
    {"ệuz", "ếu"}, 
	{"ệuf", "ều"}, 
	{"ệur", "ểu"}, 
	{"ệux", "ễu"},

	// i ////////////////////////////////////////////////////
    {"iz", "í"},
    {"if", "ì"},
    {"ir", "ỉ"},
    {"ix", "ĩ"},
    {"ij", "ị"},
    // 
    {"íf", "ì"}, 
	{"ír", "ỉ"}, 
	{"ìx", "ĩ"}, 
	{"íj", "ị"},
	//
    {"ìz", "í"}, 
	{"ìr", "ỉ"}, 
	{"ìx", "ĩ"}, 
	{"ìj", "ị"},
	//
    {"ỉz", "í"}, 
	{"ỉf", "ì"}, 
	{"ỉx", "ĩ"}, 
	{"ỉj", "ị"},
	//
    {"ĩz", "í"}, 
	{"ĩf", "ì"}, 
	{"ĩr", "ỉ"}, 
	{"ĩj", "ị"},
	//
    {"ịz", "í"}, 
	{"ịf", "ì"}, 
	{"ịr", "ỉ"}, 
	{"ịx", "ĩ"},

	// ia ////////////////////////////////////////////////////
    {"iaz", "ía"},
    {"iaf", "ìa"},
    {"iar", "ỉa"},
    {"iax", "ĩa"},
    {"iaj", "ịa"},
    // 
    {"íaf", "ìa"}, 
	{"íar", "ỉa"}, 
	{"íax", "ĩa"}, 
	{"íaj", "ịa"},
	//
    {"ìaz", "ía"}, 
	{"ìar", "ỉa"}, 
	{"ìax", "ĩa"}, 
	{"ìaj", "ịa"},
	//
    {"ỉaz", "ía"}, 
	{"ỉaf", "ìa"}, 
	{"ỉax", "ĩa"}, 
	{"ỉaj", "ịa"},
	//
    {"ĩaz", "ía"}, 
	{"ĩaf", "ìa"}, 
	{"ĩar", "ỉa"}, 
	{"ĩaj", "ịa"},
	//
    {"ịaz", "ía"}, 
	{"ịaf", "ìa"}, 
	{"ịar", "ỉa"}, 
	{"ịax", "ĩa"},
    
	// iu /////////////////////////////////////////////////
    {"iuz", "íu"},
    {"iuf", "ìu"},
    {"iur", "ỉu"},
    {"iux", "ĩu"},
    {"iuj", "ịu"},
    //  
    {"íuf", "ìu"}, 
	{"íur", "ỉu"}, 
	{"íux", "ĩu"}, 
	{"íuj", "ịu"},
	//
    {"ìuz", "íu"}, 
	{"ìur", "ỉu"}, 
	{"ìux", "ĩu"}, 
	{"ìuj", "ịu"},
	//
    {"ỉuz", "íu"}, 
	{"ỉuf", "ìu"}, 
	{"ỉux", "ĩu"}, 
	{"ỉuj", "ịu"},
	//
    {"ĩuz", "íu"}, 
	{"ĩuf", "ìu"}, 
	{"ĩur", "ỉu"}, 
	{"ĩuj", "ịu"},
	//
    {"ịuz", "íu"}, 
	{"ịuf", "ìu"}, 
	{"ịur", "ỉu"}, 
	{"ịux", "ĩu"},
	
	// iê ////////////////////////////////////////////////////
    {"iee", "iê"},
	//
    {"iêz", "iế"},
    {"iêf", "iề"},
    {"iêr", "iể"},
    {"iêx", "iễ"},
    {"iêj", "iệ"},
    // 
    {"iếf", "iề"}, 
	{"iếr", "iể"}, 
	{"iếx", "iễ"}, 
	{"iếj", "iệ"},
	//
    {"iềz", "iế"}, 
	{"iềr", "iể"}, 
	{"iềx", "iễ"}, 
	{"iềj", "iệ"},
	//
    {"iểz", "iế"}, 
	{"iểf", "iề"}, 
	{"iểx", "iễ"}, 
	{"iểj", "iệ"},
	//
    {"iễz", "iế"}, 
	{"iễf", "iề"}, 
	{"iễr", "iể"}, 
	{"iễj", "iệ"},
	//
    {"iệz", "iế"}, 
	{"iệf", "iề"}, 
	{"iệr", "iể"}, 
	{"iệx", "iệ"},
	
	// iêu ///////////////////////////////////////////////////
	{"ieue", "iêu"},
	//
	{"iêuz", "iếu"},
	{"iêuf", "iều"},
	{"iêur", "iểu"},
	{"iêux", "iễu"},
	{"iêuj", "iệu"},
    // 
    {"iếuf", "iều"},
   	{"iếur", "iểu"}, 
	{"iếux", "iễu"}, 
	{"iếuj", "iệu"},
	//
    {"iềuz", "iếu"}, 
	{"iềur", "iểu"}, 
	{"iềux", "iễu"}, 
	{"iềuj", "iệu"},
	//
    {"iểuz", "iếu"}, 
	{"iểuf", "iều"}, 
	{"iểux", "iễu"}, 
	{"iểuj", "iệu"},
	//
    {"iễuz", "iếu"}, 
	{"iễuf", "iều"}, 
	{"iễur", "iểu"}, 
	{"iễuj", "iệu"},
	//
    {"iệuz", "iếu"}, 
	{"iệuf", "iều"}, 
	{"iệur", "iểu"}, 
	{"iệux", "iệu"},

	// o //////////////////////////////////////////////////
    {"oz", "ó"},
    {"of", "ò"},
    {"or", "ỏ"},
    {"ox", "õ"},
    {"oj", "ọ"},
    // 
	{"óf", "ò"}, 
	{"ór", "ỏ"}, 
	{"óx", "õ"}, 
	{"ój", "ọ"},
	//
    {"òz", "ó"}, 
	{"òr", "ỏ"}, 
	{"òx", "õ"}, 
	{"òj", "ọ"},
	//
    {"ỏz", "ó"}, 
	{"ỏf", "ò"}, 
	{"ỏx", "õ"}, 
	{"ỏj", "ọ"},
	//
    {"õz", "ó"}, 
	{"õf", "ò"}, 
	{"õr", "ỏ"}, 
	{"õj", "ọ"},
	//
    {"ọz", "ó"}, 
	{"ọf", "ò"}, 
	{"ọr", "ỏ"}, 
	{"ọx", "õ"},
    
	// oa ///////////////////////////////////////////////////
    {"oaz", "óa"},
    {"oaf", "òa"},
    {"oar", "ỏa"},
    {"oax", "õa"},
    {"oaj", "ọa"},
    //  
    {"óaf", "òa"}, 
	{"óar", "ỏa"}, 
	{"óax", "õa"}, 
	{"óaj", "ọa"},
	//
    {"òaz", "óa"}, 
	{"òar", "ỏa"}, 
	{"òax", "õa"}, 
	{"òaj", "ọa"},
	//
    {"ỏaz", "óa"}, 
	{"ỏaf", "òa"}, 
	{"ỏax", "õa"}, 
	{"ỏaj", "ọa"},
	//
    {"õaz", "óa"}, 
	{"õaf", "òa"}, 
	{"õar", "ỏa"}, 
	{"õaj", "ọa"},
	//
    {"ọaz", "óa"}, 
	{"ọaf", "òa"}, 
	{"ọar", "ỏa"}, 
	{"ọax", "õa"},
	 
    ////  
    {"oáf", "oà"}, 
	{"oár", "oả"}, 
	{"oáx", "oã"}, 
	{"oáj", "oạ"},
	//
    {"oàz", "oá"}, 
	{"oàr", "oả"}, 
	{"oàx", "oã"}, 
	{"oàj", "oạ"},
	//
    {"oảz", "oá"}, 
	{"oảf", "oà"}, 
	{"oảx", "oã"}, 
	{"oảj", "oạ"},
	//
    {"oãz", "oá"}, 
	{"oãf", "oà"}, 
	{"oãr", "oả"}, 
	{"oãj", "oạ"},
	//
    {"oạz", "oá"}, 
	{"oạf", "oà"}, 
	{"oạr", "oả"}, 
	{"oạx", "oã"},

	// oai ///////////////////////////////////////////////////
    {"oaiz", "oái"},
    {"oaif", "oài"},
    {"oair", "oải"},
    {"oaix", "oãi"},
    {"oaij", "oại"},
    //  
    {"oáif", "oài"}, 
	{"oáir", "oải"}, 
	{"oáix", "oãi"}, 
	{"oáij", "oại"},
	//
    {"oàiz", "oái"}, 
	{"oàir", "oải"}, 
	{"oàix", "oãi"}, 
	{"oàij", "oại"},
	//
    {"oảiz", "oái"}, 
	{"oảif", "oài"}, 
	{"oảix", "oãi"}, 
	{"oảij", "oại"},
	//
    {"oãiz", "oái"}, 
	{"oãif", "oài"}, 
	{"oãir", "oải"}, 
	{"oãij", "oại"},
	//
    {"oạiz", "oái"}, 
	{"oạif", "oài"}, 
	{"oạir", "oải"}, 
	{"oạix", "oãi"},

    // oă /////////////////////////////////////////////////////
	{"oaw", "oă"}, 
    {"oăz", "oắ"},
    {"oăf", "oằ"},
    {"oăr", "oẳ"},
    {"oăx", "oẵ"},
    {"oăj", "oặ"},
    // 
    {"oắf", "oằ"}, 
	{"oắr", "oẳ"}, 
	{"oắx", "oẵ"}, 
	{"oắj", "oặ"},
	//
    {"oằz", "oắ"}, 
	{"oằr", "oẳ"}, 
	{"oằx", "oẵ"}, 
	{"oằj", "oặ"},
	//
    {"oẳz", "oắ"}, 
	{"oẳf", "oằ"}, 
	{"oẳx", "oẵ"}, 
	{"oẳj", "oặ"},
	//
    {"oẵz", "oắ"}, 
	{"oẵf", "oằ"}, 
	{"oẵr", "oẳ"}, 
	{"oẵj", "oặ"},
	//
    {"oặz", "oắ"}, 
	{"oặf", "oằ"}, 
	{"oặr", "oẳ"}, 
	{"oặx", "oẵ"},

	// oe ////////////////////////////////////////////////////////
    {"oez", "óe"},
    {"oef", "òe"},
    {"oer", "ỏe"},
    {"oex", "õe"},
    {"oej", "ọe"},
    // 
    {"óef", "òe"}, 
	{"óer", "ỏe"}, 
	{"óex", "õe"}, 
	{"óej", "ọe"},
	//
    {"òez", "óe"}, 
	{"òer", "ỏe"}, 
	{"òex", "õe"}, 
	{"òej", "ọe"},
	//
    {"ỏez", "óe"}, 
	{"ỏef", "òe"}, 
	{"ỏex", "õe"}, 
	{"ỏej", "ọe"},
	//
    {"õez", "óe"}, 
	{"õef", "òe"}, 
	{"õer", "ỏe"}, 
	{"õej", "ọe"},
	//
    {"ọez", "óe"}, 
	{"ọef", "òe"}, 
	{"ọer", "ỏe"}, 
	{"ọex", "õe"},
    
	// oi ////////////////////////////////////////////////////////
    {"oiz", "ói"},
    {"oif", "òi"},
    {"oir", "ỏi"},
    {"oix", "õi"},
    {"oij", "ọi"},
    //  
    {"óif", "òi"}, 
	{"óir", "ỏi"}, 
	{"óix", "õi"}, 
	{"óij", "ọi"},
	//
    {"òiz", "ói"}, 
	{"òir", "ỏi"}, 
	{"òix", "õi"}, 
	{"òij", "ọi"},
	//
    {"ỏiz", "ói"}, 
	{"ỏif", "òi"}, 
	{"ỏix", "õi"}, 
	{"ỏij", "ọi"},
	//
    {"õiz", "ói"}, 
	{"õif", "òi"}, 
	{"õir", "ỏi"}, 
	{"õij", "ọi"},
	//
    {"ọiz", "ói"}, 
	{"ọif", "òi"}, 
	{"ọir", "ỏi"}, 
	{"ọix", "õi"},

	// ô /////////////////////////////////////////////////////
    {"oo", "ô"},
	//
    {"ôz", "ố"},
    {"ôf", "ồ"},
    {"ôr", "ổ"},
    {"ôx", "ỗ"},
    {"ôj", "ộ"},
    // 
    {"ốf", "ồ"}, 
	{"ốr", "ổ"}, 
	{"ốx", "ỗ"}, 
	{"ốj", "ộ"},
	//
    {"ồz", "ố"}, 
	{"ồr", "ổ"}, 
	{"ồx", "ỗ"}, 
	{"ồj", "ộ"},
	//
    {"ổz", "ố"}, 
	{"ổf", "ồ"}, 
	{"ổx", "ỗ"}, 
	{"ổj", "ộ"},
	//
    {"ỗz", "ố"}, 
	{"ỗf", "ồ"}, 
	{"ỗr", "ổ"}, 
	{"ỗj", "ộ"},
	//
    {"ộz", "ố"}, 
	{"ộf", "ồ"}, 
	{"ộr", "ổ"}, 
	{"ộx", "ỗ"},
    
	// ôi /////////////////////////////////////////////////
    {"ôiz", "ối"},
    {"ôif", "ồi"},
    {"ôir", "ổi"},
    {"ôix", "ỗi"},
    {"ôij", "ội"},
    //  
    {"ốif", "ồi"}, 
	{"ốir", "ổi"}, 
	{"ốix", "ỗi"}, 
	{"ốij", "ội"},
	//
    {"ồiz", "ối"}, 
	{"ồir", "ổi"}, 
	{"ồix", "ỗi"}, 
	{"ồij", "ội"},
	//
    {"ổiz", "ối"}, 
	{"ổif", "ồi"}, 
	{"ổix", "ỗi"}, 
	{"ổij", "ội"},
	//
    {"ỗiz", "ối"}, 
	{"ỗif", "ồi"}, 
	{"ỗir", "ổi"}, 
	{"ỗij", "ội"},
	//
    {"ộiz", "ối"},
	{"ộif", "ồi"}, 
	{"ộir", "ổi"}, 
	{"ộix", "ỗi"},

	// ơ ///////////////////////////////////////////////////////
    {"ow", "ơ"},
    {"ơz", "ớ"},
    {"ơf", "ờ"},
    {"ơr", "ở"},
    {"ơx", "ỡ"},
    {"ơj", "ợ"},
    // 
    {"ớf", "ờ"}, 
	{"ớr", "ở"}, 
	{"ớx", "ỡ"}, 
	{"ớj", "ợ"},
	//
    {"ờz", "ớ"}, 
	{"ờr", "ở"}, 
	{"ờx", "ỡ"}, 
	{"ờj", "ợ"},
	//
    {"ởz", "ớ"}, 
	{"ởf", "ờ"}, 
	{"ởx", "ỡ"}, 
	{"ởj", "ợ"},
	//
    {"ỡz", "ớ"}, 
	{"ỡf", "ờ"}, 
	{"ỡr", "ở"}, 
	{"ỡj", "ợ"},
	//
    {"ợz", "ớ"}, 
	{"ợf", "ờ"}, 
	{"ợr", "ở"}, 
	{"ợx", "ỡ"},
    
	// ơi /////////////////////////////////////////////////////
    {"ơiz", "ới"},
    {"ơif", "ời"},
    {"ơir", "ởi"},
    {"ơix", "ỡi"},
    {"ơij", "ợi"},
    //  
    {"ớif", "ời"},
   	{"ớir", "ởi"},
   	{"ớix", "ỡi"}, 
	{"ớij", "ợi"},
	//
    {"ờiz", "ới"},
   	{"ờir", "ởi"},
   	{"ờix", "ỡi"},
   	{"ờij", "ợi"},
	//
    {"ởiz", "ới"},
   	{"ởif", "ời"},
   	{"ởix", "ỡi"},
   	{"ởij", "ợi"},
	//
    {"ỡiz", "ới"},
   	{"ỡif", "ời"},
   	{"ỡir", "ởi"},
   	{"ỡij", "ợi"},
	//
    {"ợiz", "ới"}, 
	{"ợif", "ời"}, 
	{"ợir", "ởi"}, 
	{"ợix", "ỡi"},

	// u /////////////////////////////////////////////////////
    {"uz", "ú"},
    {"uf", "ù"},
    {"ur", "ủ"},
    {"ux", "ũ"},
    {"uj", "ụ"},
    // 
    {"úf", "ù"}, 
	{"úr", "ủ"}, 
	{"úx", "ũ"}, 
	{"új", "ụ"},
	//
    {"ùz", "ú"}, 
	{"ùr", "ủ"}, 
	{"ùx", "ũ"}, 
	{"ùj", "ụ"},
	//
    {"ủz", "ú"}, 
	{"ủf", "ù"}, 
	{"ủx", "ũ"}, 
	{"ủj", "ụ"},
	//
    {"ũz", "ú"}, 
	{"ũf", "ù"}, 
	{"ũr", "ủ"}, 
	{"ũj", "ụ"},
	//
    {"ụz", "ú"}, 
	{"ụf", "ù"}, 
	{"ụr", "ủ"}, 
	{"ụx", "ũ"},

    // ua //////////////////////////////////////////////////
    {"uaz", "úa"},
    {"uaf", "ùa"},
    {"uar", "ủa"},
    {"uax", "ũa"},
    {"uaj", "ụa"},
    // 
    {"úaf", "ùa"}, 
	{"úar", "ủa"}, 
	{"úax", "ũa"}, 
	{"úaj", "ụa"},
	//
    {"ùaz", "úa"}, 
	{"ùar", "ủa"}, 
	{"ùax", "ũa"}, 
	{"ùaj", "ụa"},
	//
    {"ủaz", "úa"}, 
	{"ủaf", "ùa"}, 
	{"ủax", "ũa"}, 
	{"ủaj", "ụa"},
	//
    {"ũaz", "úa"}, 
	{"ũaf", "ùa"}, 
	{"ũar", "ủa"}, 
	{"ũaj", "ụa"},
	//
    {"ụaz", "úa"}, 
	{"ụaf", "ùa"}, 
	{"ụar", "ủa"}, 
	{"ụax", "ũa"},
    
	// uâ //////////////////////////////////////////////////////
    {"uaa", "uâ"},
    {"uâz", "uấ"},
    {"uâf", "uầ"},
    {"uâr", "uẩ"},
    {"uâx", "uẫ"},
    {"uâj", "uậ"},
    // 
    {"uấf", "uầ"}, 
	{"uấr", "uẩ"}, 
	{"uấx", "uẫ"},
   	{"uấj", "uậ"},
	//
    {"uầz", "uấ"}, 
	{"uầr", "uẩ"}, 
	{"uầx", "uẫ"}, 
	{"uầj", "uậ"},
	//
    {"uẩz", "uấ"}, 
	{"uẩf", "uầ"}, 
	{"uẩx", "uẫ"}, 
	{"uẩj", "uậ"},
	//
    {"uẫz", "uấ"}, 
	{"uẫf", "uầ"}, 
	{"uẫr", "uẩ"}, 
	{"uẫj", "uậ"},
	//
    {"uậz", "uấ"}, 
	{"uậf", "uầ"}, 
	{"uậr", "uẩ"}, 
	{"uậx", "uẫ"},

    // uê ////////////////////////////////////////////////////
    {"uee", "uê"},
    {"uêz", "uế"},
    {"uêf", "uề"},
    {"uêr", "uể"},
    {"uêx", "uễ"},
    {"uêj", "uệ"},
    // 
    {"uếf", "uề"}, 
	{"uếr", "uể"}, 
	{"uếx", "uễ"}, 
	{"uếj", "uệ"},
	//
    {"uềz", "uế"}, 
	{"uềr", "uể"}, 
	{"uềx", "uễ"}, 
	{"uềj", "uệ"},
	//
    {"uểz", "uế"}, 
	{"uểf", "uề"}, 
	{"uểx", "uễ"}, 
	{"uểj", "uệ"},
	//
    {"uễz", "uế"}, 
	{"uễf", "uề"}, 
	{"uễr", "uể"}, 
	{"uễj", "uệ"},
	//
    {"uệz", "uế"}, 
	{"uệf", "uề"}, 
	{"uệr", "uể"}, 
	{"uệx", "uễ"},
    
	// ui //////////////////////////////////////////////////
    {"uiz", "úi"},
    {"uif", "ùi"},
    {"uir", "ủi"},
    {"uix", "ũi"},
    {"uij", "ụi"},
    // 
    {"úif", "ùi"}, 
	{"úir", "ủi"}, 
	{"úix", "ũi"}, 
	{"úij", "ụi"},
	//
    {"ùiz", "úi"}, 
	{"ùir", "ủi"}, 
	{"ùix", "ũi"}, 
	{"ùij", "ụi"},
	//
    {"ủiz", "úi"}, 
	{"ủif", "ùi"}, 
	{"ủix", "ũi"}, 
	{"ủij", "ụi"},
	//
    {"ũiz", "úi"}, 
	{"ũif", "ùi"}, 
	{"ũir", "ủi"}, 
	{"ũij", "ụi"},
	//
    {"ụiz", "úi"}, 
	{"ụif", "ùi"}, 
	{"ụir", "ủi"}, 
	{"ụix", "ũi"},

	// uô ////////////////////////////////////////////////////
    {"uoo", "uô"},
    {"uôz", "uố"},
    {"uôf", "uồ"},
    {"uôr", "uổ"},
    {"uôx", "uỗ"},
    {"uôj", "uộ"},
    // 
    {"uốf", "uồ"}, 
	{"uốr", "uổ"}, 
	{"uốx", "uỗ"}, 
	{"uốj", "uộ"},
	//
    {"uồz", "uố"}, 
	{"uồr", "uổ"}, 
	{"uồx", "uỗ"}, 
	{"uồj", "uộ"},
	//
    {"uổz", "uố"}, 
	{"uổf", "uồ"}, 
	{"uổx", "uỗ"}, 
	{"uổj", "uộ"},
	//
    {"uỗz", "uố"}, 
	{"uỗf", "uồ"}, 
	{"uỗr", "uổ"}, 
	{"uỗj", "uộ"},
	//
    {"uộz", "uố"}, 
	{"uộf", "uồ"}, 
	{"uộr", "uổ"}, 
	{"uộx", "uỗ"},
    

	// uôi ////////////////////////////////////////////////////
    {"uôiz", "uối"},
    {"uôif", "uồi"},
    {"uôir", "uổi"},
    {"uôix", "uỗi"},
    {"uôij", "uội"},
    // 
    {"uốif", "uồi"}, 
	{"uốir", "uổi"}, 
	{"uốix", "uỗi"}, 
	{"uốij", "uội"},
	//
    {"uồiz", "uối"}, 
	{"uồir", "uổi"}, 
	{"uồix", "uỗi"}, 
	{"uồij", "uội"},
	//
    {"uổiz", "uối"}, 
	{"uổif", "uồi"}, 
	{"uổix", "uỗi"}, 
	{"uổij", "uội"},
	//
    {"uỗiz", "uối"}, 
	{"uỗif", "uồi"}, 
	{"uỗir", "uổi"}, 
	{"uỗij", "uội"},
	//
    {"uộiz", "uối"}, 
	{"uộif", "uồi"}, 
	{"uộir", "uổi"}, 
	{"uộix", "uỗi"},

    // uy ///////////////////////////////////////////////////
    {"uyz", "úy"},
    {"uyf", "ùy"},
    {"uyr", "ủy"},
    {"uyx", "ũy"},
    {"uyj", "ụy"},
    // 
    {"úyf", "ùy"}, 
	{"úyr", "ủy"}, 
	{"úyx", "ũy"}, 
	{"úyj", "ụy"},
	//
    {"ùyz", "úy"}, 
	{"ùyr", "ủy"}, 
	{"ùyx", "ũy"}, 
	{"ùyj", "ụy"},
	//
    {"ủyz", "úy"}, 
	{"ủyf", "ùy"}, 
	{"ủyx", "ũy"}, 
	{"ủyj", "ụy"},
	//
    {"ũyz", "úy"}, 
	{"ũyf", "ùy"}, 
	{"ũyr", "ủy"}, 
	{"ũyj", "ụy"},
	//
    {"ụyz", "úy"}, 
	{"ụyf", "ùy"}, 
	{"ụyr", "ủy"}, 
	{"ụyx", "ũy"},
	
	// uyên ///////////////////////////////////////////////////////
    {"uyee", "uyê"},
    {"uyêz", "uyế"},
    {"uyêf", "uyề"},
    {"uyêr", "uyể"},
    {"uyêx", "uyễ"},
    {"uyêj", "uyệ"},
    // 
    {"uyếf", "uyề"}, 
	{"uyếr", "uyể"}, 
	{"uyếx", "uyễ"}, 
	{"uyếj", "uyệ"},
	//
    {"uyềz", "uyế"}, 
	{"uyềr", "uyể"}, 
	{"uyềx", "uyễ"}, 
	{"uyềj", "uyệ"},
	//
    {"uyểz", "uyế"}, 
	{"uyểf", "uyề"}, 
	{"uyểx", "uyễ"}, 
	{"uyểj", "uyệ"},
	//
    {"uyễz", "uyế"}, 
	{"uyễf", "uyề"}, 
	{"uyễr", "uyể"}, 
	{"uyễj", "uyệ"},
	//
    {"uyệz", "uyế"}, 
	{"uyệf", "uyề"}, 
	{"uyệr", "uyể"}, 
	{"uyệx", "uyễ"},

	// ư /////////////////////////////////////////////////////
    {"uw", "ư"},
    {"ưz", "ứ"},
    {"ưf", "ừ"},
    {"ưr", "ử"},
    {"ưx", "ữ"},
    {"ưj", "ự"},
    // 
    {"ứf", "ừ"},
   	{"ứr", "ử"},
   	{"ứx", "ữ"},
   	{"ứj", "ự"},
	//
    {"ừz", "ứ"},
   	{"ừr", "ử"},
   	{"ừx", "ữ"},
   	{"ừj", "ự"},
	//
    {"ửz", "ứ"},
   	{"ửf", "ừ"},
   	{"ửx", "ữ"},
   	{"ửj", "ự"},
	//
    {"ữz", "ứ"},
   	{"ữf", "ừ"},
   	{"ữr", "ử"},
   	{"ữj", "ự"},
	//
    {"ựz", "ứ"},
   	{"ựf", "ừ"},
   	{"ựr", "ử"},
   	{"ựx", "ữ"},

	// ưa //////////////////////////////////////////////////////
    {"ưaz", "ứa"},
    {"ưaf", "ừa"},
    {"ưar", "ửa"},
    {"ưax", "ữa"},
    {"ưaj", "ựa"},
    //  
    {"ứaf", "ừa"}, 
	{"ứar", "ửa"},
   	{"ứax", "ữa"},
   	{"ứaj", "ựa"},
	//
    {"ừaz", "ứa"},
   	{"ừar", "ửa"},
   	{"ừax", "ữa"},
   	{"ừaj", "ựa"},
	//
    {"ửaz", "ứa"}, 
	{"ửaf", "ừa"}, 
	{"ửax", "ữa"},
   	{"ửaj", "ựa"},
	//
    {"ữaz", "ứa"},
   	{"ữaf", "ừa"},
   	{"ữar", "ửa"},
   	{"ữaj", "ựa"},
	//
    {"ựaz", "ứa"},
   	{"ựaf", "ừa"},
   	{"ựar", "ửa"},
   	{"ựax", "ữa"},
    
    // ưi //////////////////////////////////////////////////////
    {"ưiz", "ứi"},
    {"ưif", "ừi"},
    {"ưir", "ửi"},
    {"ưix", "ữi"},
    {"ưij", "ựi"},
    //  
    {"ứif", "ừi"}, 
	{"ứir", "ửi"}, 
	{"ứix", "ữi"}, 
	{"ứij", "ựi"},
	//
    {"ừiz", "ứi"}, 
	{"ừir", "ửi"}, 
	{"ừix", "ữi"}, 
	{"ừij", "ựi"},
	//
    {"ửiz", "ứi"}, 
	{"ửif", "ừi"}, 
	{"ửix", "ữi"}, 
	{"ửij", "ựi"},
	//
    {"ữiz", "ứi"}, 
	{"ữif", "ừi"}, 
	{"ữir", "ửi"}, 
	{"ữij", "ựi"},
	//
    {"ựiz", "ứi"}, 
	{"ựif", "ừi"}, 
	{"ựir", "ửi"}, 
	{"ựix", "ữi"},

	// ươ /////////////////////////////////////////////////////////
    {"ưow", "ươ"},
    {"ươz", "ướ"},
    {"ươf", "ườ"},
    {"ươr", "ưở"},
    {"ươx", "ưỡ"},
    {"ươj", "ượ"},
    // 
    {"ướf", "ườ"}, 
	{"ướr", "ưở"}, 
	{"ướx", "ưỡ"}, 
	{"ướj", "ượ"},
	//
    {"ườz", "ướ"}, 
	{"ườr", "ưở"}, 
	{"ườx", "ưỡ"}, 
	{"ườj", "ượ"},
	//
    {"ưởz", "ướ"}, 
	{"ưởf", "ườ"}, 
	{"ưởx", "ưỡ"}, 
	{"ươj", "ượ"},
	//
    {"ưỡz", "ướ"}, 
	{"ưỡf", "ườ"}, 
	{"ưỡr", "ưở"}, 
	{"ưỡj", "ượ"},
	//
    {"ượz", "ướ"}, 
	{"ượf", "ườ"}, 
	{"ượr", "ưở"}, 
	{"ượx", "ưỡ"},
    
    // ưu //////////////////////////////////////////////////////////
    {"ưuz", "ứu"},
    {"ưuf", "ừu"},
    {"ưur", "ửu"},
    {"ưux", "ữu"},
    {"ưuj", "ựu"},
    //  
    {"ứuf", "ừu"}, 
	{"ứur", "ửu"}, 
	{"ứux", "ữu"}, 
	{"ứuj", "ựu"},
	//
    {"ừuz", "ứu"}, 
	{"ừur", "ửu"}, 
	{"ừux", "ữu"}, 
	{"ừuj", "ựu"},
	//
    {"ửuz", "ứu"}, 
	{"ửuf", "ừu"}, 
	{"ửux", "ữu"}, 
	{"ửuj", "ựu"},
	//
    {"ữuz", "ứu"}, 
	{"ữuf", "ừu"}, 
	{"ữur", "ửu"}, 
	{"ữuj", "ựu"},
	//
    {"ựuz", "ứu"}, 
	{"ựuf", "ừu"}, 
	{"ựur", "ửu"}, 
	{"ựux", "ữu"},
    
	// y ////////////////////////////////////////////////////
    {"yz", "ý"},
    {"yf", "ỳ"},
    {"yr", "ỷ"},
    {"yx", "ỹ"},
    {"yj", "ỵ"},
    // 
    {"ýf", "ỳ"}, 
	{"ýr", "ỷ"}, 
	{"ýx", "ỹ"}, 
	{"ýj", "ỵ"},
	//
    {"ỳz", "ý"}, 
	{"ỳr", "ỷ"}, 
	{"ỳx", "ỹ"}, 
	{"ỳj", "ỵ"},
	//
    {"ỷz", "ý"}, 
	{"ỷf", "ỳ"}, 
	{"ỷx", "ỹ"}, 
	{"ỷj", "ỵ"},
	//
    {"ỹz", "ý"}, 
	{"ỹf", "ỳ"}, 
	{"ỹr", "ỷ"}, 
	{"ỹj", "ỵ"},
	//
    {"ỵz", "ý"}, 
	{"ỵf", "ỳ"}, 
	{"ỵr", "ỷ"}, 
	{"ỵx", "ỹ"},

	// yê ////////////////////////////////////////////////////////
    {"yee", "yê"},
    {"yêz", "yế"},
    {"yêf", "yề"},
    {"yêr", "yể"},
    {"yêx", "yễ"},
    {"yêj", "yệ"},
    // 
    {"yếf", "yề"},
   	{"yếr", "yể"}, 
	{"yếx", "yễ"}, 
	{"yếj", "yệ"},
	//
    {"yềz", "yế"},
   	{"yềr", "yể"},
   	{"yềx", "yễ"},
   	{"yềj", "yệ"},
	//
    {"yểz", "yế"},
   	{"yểf", "yề"},
   	{"yểx", "yễ"},
   	{"yểj", "yệ"},
	//
    {"yễz", "yế"},
   	{"yễf", "yề"},
   	{"yễr", "yể"},
   	{"yễj", "yệ"},
	//
    {"yệz", "yế"},
   	{"yệf", "yề"},
   	{"yệr", "yể"},
   	{"yệx", "yễ"},
    
	// yêu //////////////////////////////////////////////////////
	{"yeue", "yêu"},
	//
	{"yêuz", "yếu"},
	{"yêuf", "yều"},
	{"yêur", "yểu"},
	{"yêux", "yễu"},
	{"yêuj", "yệu"},
	//
    {"yếuf", "yều"},
   	{"yếur", "yểu"},
   	{"yếux", "yễu"},
   	{"yếuj", "yệu"},
	//
    {"yềuz", "yếu"},
   	{"yềur", "yểu"},
   	{"yềux", "yễu"},
   	{"yềuj", "yệu"},
	//
    {"yểuz", "yếu"},
   	{"yểuf", "yều"},
   	{"yểux", "yễu"},
   	{"yểuj", "yệu"},
	//
    {"yễuz", "yếu"},
   	{"yễuf", "yều"},
   	{"yễur", "yểu"},
   	{"yễuj", "yệu"},
	//
    {"yệuz", "yếu"},
   	{"yệuf", "yều"},
   	{"yệur", "yểu"},
   	{"yệux", "yệu"},
	

    // extra entries
    {"ôw","ơ"}, {"uôw", "ươ"},{"ôiw", "ơi"},
    {"ơo","ô"}, {"ươo", "uô"},{"ơio", "ôi"},
    {"ăa","â"}, {"âw", "ă"},

    // ố
    {"ốw","ớ"}, {"uốw", "ướ"},{"ốiw", "ới"},


};

/**
 * This table is used to make position of symbol correctly when a clutter has final consonant
 */
static struct _CORRECT_CLUTTER _correct_clutters[] = {
	// oa
	{"óa", "oá"},
	{"òa", "oà"},
	{"ỏa", "oả"},
	{"õa", "oã"},
	{"ọa", "oạ"},

	//ua
	{"úa", "uá"},
	{"ùa", "uà"},
	{"ủa", "uả"},
	{"ũa", "uã"},
	{"ụa", "uạ"},
	
};

static GHashTable* _telex_hash_table = NULL;
static GHashTable* _correct_hash_table = NULL;

void vh_z_telex_table_init(){
    int i = 0;
    if(!_telex_hash_table){
        _telex_hash_table = g_hash_table_new(g_str_hash, g_str_equal);
        for(i = 0; i < sizeof(_clutters)/sizeof(_clutters[0]); i++){
            g_hash_table_insert(
					_telex_hash_table, 
					_clutters[i].telex_clutter, 
					_clutters[i].vn_clutter
			);
        }
    }
    if(!_correct_hash_table){
        _correct_hash_table = g_hash_table_new(g_str_hash, g_str_equal);
        for(i = 0; i < sizeof(_correct_clutters)/sizeof(_correct_clutters[0]); i++){
            g_hash_table_insert(
					_correct_hash_table, 
					_correct_clutters[i].clutter, 
					_correct_clutters[i].correct_clutter
			);
        }
    }
}

void vh_z_telex_table_destroy(){
    if(_telex_hash_table){
        g_hash_table_remove_all(_telex_hash_table);
        g_hash_table_destroy(_telex_hash_table);
        _telex_hash_table = NULL;
    }   
    if(_correct_hash_table){
        g_hash_table_remove_all(_correct_hash_table);
        g_hash_table_destroy(_correct_hash_table);
        _correct_hash_table = NULL;
    }   
}

// Make position of symbol correctly when a clutter have final consonant
const gchar * _correct_sign_position(const gchar* vn_clutter){
    const gchar* correct_clutter = (gchar*)g_hash_table_lookup(_correct_hash_table, vn_clutter);
    if(correct_clutter){
		return correct_clutter;
    }else{
        return NULL;
    }
}

/**
 * Convert a telex clutter into a vietnamese clutter
 * len: (out), length of vietnamese clutter
 */
gunichar * vh_z_telex_table_convert_to_vietnamese(const gchar* telex_clutter, gunichar end_consonant, guint* len){
    glong written = 0;
    const gchar* vn_clutter = (gchar*)g_hash_table_lookup(_telex_hash_table, telex_clutter);

    //
    if (!vn_clutter) {
    	return NULL;
    }

    //
	if(end_consonant){
		const gchar * correct_clutter = _correct_sign_position(vn_clutter);
		if(correct_clutter){
			vn_clutter = correct_clutter;
		}
	}

	//
	gunichar *unichar_vn_clutter = g_utf8_to_ucs4_fast(vn_clutter, -1, &written);
	if (!unichar_vn_clutter) {
		return NULL;
	}

	// return result
	if(len){
		*len = written;
	}
	return unichar_vn_clutter;
}

